Marks100/STM32_RFM69_receiver/Src/CLI/CLI.c
            if( CLI_rx_command_len != 0u )
            {
            	/* Dont add the new command if its already on the current list */
				for( i = 0u; i < useable_commands; i++ )
				{
					if( STDC_memcompare( CLI_cmd_history_s.cmd_list[i].cmd, CLI_msg_read_s, CLI_rx_command_len ) )
					{
						command_present = TRUE;
						break;
					}
				}

				if( command_present == FALSE )
				{
	            	if( useable_commands != CLI_MAX_COMMAND_HISTORY)
					{
						 /* Setup the index for the first command entered by the user, as the history is not full */
						 CLI_cmd_history_s.index_to_next_cmd = ( useable_commands  % CLI_MAX_COMMAND_HISTORY );
					}

					STDC_memset( &CLI_cmd_history_s.cmd_list[CLI_cmd_history_s.index_to_next_cmd].cmd, 0x00, sizeof( CLI_cmd_history_s.cmd_list[CLI_cmd_history_s.index_to_next_cmd].cmd ) );

					STDC_memcpy( &CLI_cmd_history_s.cmd_list[CLI_cmd_history_s.index_to_next_cmd].cmd, CLI_msg_read_s, CLI_rx_command_len );

					CLI_cmd_history_s.index_to_next_cmd = ( CLI_cmd_history_s.index_to_next_cmd + 1u )%CLI_MAX_COMMAND_HISTORY;
				}
            }

            CLI_store_history();
        }
        else if( received_char == CLI_DEL )
        {
            CLI_byte_index_s = 0u;
            STDC_memset( CLI_msg_read_s, 0x00, sizeof( CLI_msg_read_s ) );
            CLI_msg_read_s[ CLI_byte_index_s ] = 0u;
            CLI_send_data( (u8_t*)ERASE_CURRENT_LINE, strlen(ERASE_CURRENT_LINE));
            CLI_print_prompt( FALSE );
        }
        else if ( received_char == CLI_BACKSPACE )
        {
        	if( CLI_byte_index_s > 0u )
        	{
				CLI_byte_index_s--;
				CLI_msg_read_s[ CLI_byte_index_s ] = 0x00;
				CLI_send_data( "\b ", strlen("\b ") );
				CLI_send_data( &received_char, 1u );
        	}

            return;
        }
        else if( ( received_char == UP_ARROW || received_char == DOWN_ARROW ) && ( CLI_msg_read_s[ CLI_byte_index_s - 1u ] == '[' ) )
        {
            //received 'A' and may be we had received a '[' previously which means a up arrow has been hit.
            //load the previous command and print it and wait for the carriage return
            CLI_msg_read_s[ CLI_byte_index_s++ ] = received_char;

            /* If there are no useable commands then dont allow the user to scroll up or down */
            if( useable_commands != 0u )
            {
				if( received_char == UP_ARROW )
				{
					if( CLI_cmd_history_s.index_to_next_cmd == 0u )
					{
						CLI_cmd_history_s.index_to_next_cmd = ( useable_commands - 1u );
					}
					else
					{
						CLI_cmd_history_s.index_to_next_cmd -= 1u;
					}
				}
				else
				{
					CLI_cmd_history_s.index_to_next_cmd = ( ( CLI_cmd_history_s.index_to_next_cmd + 1u ) % useable_commands );
				}

				CLI_store_history();

				STDC_memset( CLI_msg_read_s, 0x00, sizeof( CLI_msg_read_s ) );
				strcpy( CLI_msg_read_s, CLI_cmd_history_s.cmd_list[ CLI_cmd_history_s.index_to_next_cmd ].cmd);

				CLI_byte_index_s = strlen( CLI_cmd_history_s.cmd_list[ CLI_cmd_history_s.index_to_next_cmd ].cmd );

				CLI_send_data( (u8_t*)ERASE_CURRENT_LINE, strlen(ERASE_CURRENT_LINE) );

				CLI_print_prompt( FALSE );

				CLI_send_data( CLI_msg_read_s, strlen( CLI_msg_read_s ) );
            }
            return;
        }
        else if( ( received_char == LEFT_ARROW || received_char == RIGHT_ARROW ) && ( CLI_msg_read_s[ CLI_byte_index_s - 1u ] == '[' ) )
        {
        	/* handle the left and right arrow keys aswell, but for now just ignore them */
        	return;
        }
        else if( received_char == '[' )
        {
            CLI_msg_read_s[ CLI_byte_index_s++ ] = received_char;
            return;
        }
        else
        {
            if( CLI_byte_index_s < CLI_MAX_INPUT_CHARS )
            {
            	/* Record every byte that gets received */
            	CLI_msg_read_s[ CLI_byte_index_s++ ] = received_char;
            	CLI_send_data( &received_char, sizeof(received_char) );
            }
        }
    }
}

void CLI_clear_rx_buffer( void )
{
     STDC_memset( CLI_msg_read_s, 0x00, sizeof( CLI_msg_read_s ) );
     CLI_byte_index_s = 0u;
     CLI_rx_command_len = 0u;
}


false_true_et CLI_carriage_return_check( void )
{
    false_true_et return_type = FALSE;

    if( CLI_cr_received_s == TRUE )
    {
        return_type = TRUE;
    }
    return ( return_type );
}



false_true_et CLI_is_space_or_newLine( char c )
{
    false_true_et return_type = FALSE;

    if( (c == ' ') || (c == '\t') || (c == '\r') || (c == '\n') )
    {
        return_type = TRUE;
    }
    return ( return_type );
}


false_true_et CLI_is_hex_char( char c )
{
    false_true_et return_type = FALSE;

    if( (c >= '0' && c <= '9') || (c >= 'a' && c <= 'f') || (c >= 'A' && c <= 'F') )
    {
        return_type = TRUE;
    }

    return ( return_type );
}

false_true_et CLI_is_dec_char( char c )
{
    false_true_et return_type = FALSE;

    if( c >= '0' && c <= '9' )
    {
        return_type = TRUE;
    }
    return ( return_type );
}


unsigned long long CLI_str_to_hex( const char* str )
{
    return (unsigned long long) strtoull(str, 0, 16);
}

void CLI_send_newline( void )
{
    CLI_send_data( (char*)CLI_newline, sizeof( CLI_newline ) );
}

void CLI_print_welcome_message( void )
{
    CLI_send_data( (char*)CLI_welcome_message_s, sizeof( CLI_welcome_message_s ) );
}

void CLI_print_prompt( false_true_et newline )
{
    char prompt_string[100u];

    STDC_memset( prompt_string, 0x20, sizeof( prompt_string ) );

    if( newline == TRUE )
    {
    	CLI_send_newline();
    	CLI_send_newline();
    }
    sprintf(  prompt_string, "CLI PROMPT>" );

    CLI_send_data( (u8_t*)prompt_string, strlen( prompt_string ) );
}


void CLI_send_data( char* data, u16_t data_size )
{
    HAL_UART_send_data( data, data_size );
}


CLI_error_et CLI_parse_cmd( char* message_string, u8_t* argumen_count, char *argument_vector[], u8_t max_num_args )
{
    CLI_error_et error = CLI_ERROR_NONE;
    char* cmd;
    u8_t calc_argumen_count = 0u;
    u8_t i = 0u;

    cmd = message_string;

