Marks100/STM32_RFM69_receiver/Src/CLI/CLI.c
    // Search for the first charachter */
    for( i = 0u; i < strlen( message_string ) - 1; i++ )
    {
    	if( CLI_is_space_or_newLine( *(cmd+i) ) != TRUE )
    	{
    		break;
    	}
    }

    /* We have pointed the command to the start of the string ignoring any leading spaces or tabs
     * and because we have found that this charachter was not a space we can immediately move to the next charachter*/

    argument_vector[calc_argumen_count++] = cmd;
    cmd += ( i + 1u );

	for (; *cmd; cmd++)
	{
		if ( CLI_is_space_or_newLine(*cmd) == TRUE )
		{
			*cmd = '\0';
		}
		else if ( *(cmd - 1u) == '\0')
		{
			if( ( calc_argumen_count ) >= max_num_args )
			{
				error = CLI_ERROR_INVALID_ARGS_MORE;
				break;
			}
			argument_vector[calc_argumen_count++] = cmd;
		}
	}

	*argumen_count = calc_argumen_count;

    return error;
}


CLI_error_et CLI_validate_arguments( u8_t aArgCount, char *aArgVector[], u8_t command_index )
{
	CLI_error_et error = CLI_ERROR_NONE;
	u8_t i = 0u;
	u8_t len = 0u;
	u32_t min_arg_value;
	u32_t max_arg_value;

	(void)min_arg_value;
	(void)max_arg_value;

	if( aArgCount > CLI_CMD_LINE_ARGS_MAX )
	{
		error = CLI_ERROR_INVALID_ARGS_MORE;
	}

	if( error == CLI_ERROR_NONE)
	{
		/* Valid number of args, now check the length of each args */
		for( i = 0u; i < aArgCount; i++ )
		{
			len = strlen( aArgVector[i+1] );
			if( len > CLI_commands[command_index].param_list[i].num_chars )
			{
				error = CLI_ERROR_INVALID_ARGS;
				break;
			}
		}

	}
	return ( error );
}



CLI_error_et CLI_process_cmd( u8_t aArgCount, char *aArgVector[] )
{
    CLI_error_et error = CLI_ERROR_NONE;
    const CLI_Command_st *cmd = NULL;
    u8_t command_index = 0u;

    for ( cmd = CLI_commands; cmd->command_name != NULL; cmd++ )
    {
        if ( (strcmp( aArgVector[0], cmd->command_name ) == 0u ) )
        {
			//the command can be executed. Now get into validating the parameters and their values provided by the user
        	error = CLI_validate_arguments( aArgCount - 1, aArgVector, command_index );
//			}
//			else
//			{
//				error = CLI_ERROR_PROHIBITED;
//			}
			// there is a matching entry in the table. just come out of the loop!
			break;
    	}
        command_index += 1u;
    }

    if( error == CLI_ERROR_NONE )
    {
		if(cmd->command_name == NULL)
		{
			// looks like we have looped through the entire table and we did not get see the command.
			error = CLI_ERROR_NOT_FOUND;
		}
    }

    if( error == CLI_ERROR_NONE  )
    {
        error = cmd->command_handler((aArgCount-1), aArgVector );
    }

    return error;
}



void CLI_store_history( void )
{
	u8_t i = 0u;

	for( i = 0u; i < CLI_MAX_COMMAND_HISTORY; i++ )
	{
		STDC_memcpy( &NVM_info_s.NVM_generic_data_blk_s.cmd_list[i], &CLI_cmd_history_s.cmd_list[i], sizeof( CLI_cmd_st ) );
	}
}


CLI_error_et help_handler( u8_t aArgCount, char *aArgVector[] )
{
	char  output_string[250] = { 0 };
	const CLI_Command_st *cmd = NULL;
	CLI_error_et error = CLI_ERROR_NONE;

	CLI_send_newline();

	for ( cmd = CLI_commands; cmd->command_name != NULL; cmd++)
	{
		STDC_memset( output_string, 0x20, sizeof( output_string ) );

		if( strcmp( cmd->command_name,"mode") == 0 )
		{
			sprintf(output_string, cmd->helpinfo);
			CLI_send_data( output_string, strlen(output_string));

			STDC_memset( output_string, 0, sizeof( output_string ) );
			CLI_send_newline();
		}
		else
		{
			sprintf(output_string, "\r\t%s", cmd->helpinfo);
			CLI_send_data( output_string, strlen(output_string));
		}
	}
	CLI_send_newline();

	return ( error );
}

CLI_error_et setmode_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;

	return( error );

}

CLI_error_et reset_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];

	STDC_memset(output_string, 0x00, sizeof(output_string));

	sprintf( output_string, "\r\nSaving NVM contents....\r\nResetting Core..." );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();

	NVM_request_flush();

	NVIC_SystemReset();

	return( error );
}

CLI_error_et readnvm_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	NVM_generic_data_blk_st* nvm_p = &(NVM_info_s.NVM_generic_data_blk_s);

	STDC_memset(output_string, 0x00, sizeof(output_string));

	sprintf( output_string, "/****** NVM data ******/\r\nChecksum:\t%X\r\nVersion:\t%d\r\nWrite count:\t%d",
	NVM_info_s.checksum,
	(int)NVM_info_s.version,
	(int)NVM_info_s.write_count );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();

	STDC_memset(output_string, 0x00, sizeof(output_string));
	sprintf( output_string, "%02X",
	nvm_p->device_id );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();

	return( error );
}

CLI_error_et ver_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	char version_num[SW_VERSION_NUM_SIZE];

	STDC_memset( output_string, 0x20, sizeof( output_string ) );

	HAL_BRD_get_SW_version_num( (u8_t*)version_num );

	CLI_send_newline();
	sprintf( output_string, "SW version is %d.%d.%d", version_num[0], version_num[1], version_num[2] );
	CLI_send_data( output_string, strlen(output_string));

	HAL_BRD_get_HW_version_num( (u8_t*)version_num );

	CLI_send_newline();
	sprintf( output_string, "HW version is %d", version_num[0] );
	CLI_send_data( output_string, strlen(output_string));

	return( error );
}



CLI_error_et setid_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	u16_t id = 0;

	id = strtoul( aArgVector[1], NULL, 16 );
	NVM_info_s.NVM_generic_data_blk_s.device_id = id;

	sprintf( output_string, "Devide ID has been set to 0x%04X", id );

	CLI_send_newline();
	CLI_send_data( output_string, strlen(output_string));

	NVM_request_flush();

	return( error );
}



CLI_error_et nvm_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	u8_t i = 0u;
	u16_t* data_p;
	u16_t temp_val;
	u16_t divisor;
	u8_t divident;
	float* temp_data_p;
	u8_t* strings[4] =
	{
		"cool mode max temp",
		"cool mode min temp",
		"heat mode max temp",
		"heat mode min temp"
	};


	STDC_memset( output_string, 0x00, sizeof( output_string ) );

	CLI_send_newline();
	CLI_send_newline();
	sprintf( output_string, "/****** NVM data ******/\r\nchksum:\t\t0x%02X\r\nVers:\t\t%d\r\nwrites:\t\t%d",
																									   NVM_info_s.checksum,
																								  (int)NVM_info_s.version,
																								  (int)NVM_info_s.write_count );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();
	CLI_send_newline();

	STDC_memset( output_string, 0x00, sizeof( output_string ) );
	sprintf( output_string, "Device ID:\t\t0x%02X\r\n\rWhitelist state:\t%d",
	(int)NVM_info_s.NVM_generic_data_blk_s.device_id, (int)NVM_info_s.NVM_generic_data_blk_s.whitelist_state );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();
	CLI_send_newline();


	STDC_memset( output_string, 0x00, sizeof( output_string ) );
	sprintf( output_string, "/* Stored CLI commands */" );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();

