Marks100/STM32_RFM69_receiver/Src/CLI/CLI.c
	for( i = 0u; i < CLI_MAX_COMMAND_HISTORY; i++ )
	{
		STDC_memset( output_string, 0x00, sizeof( output_string ) );
		sprintf( output_string, "%2d: %s\r\n", i + 1, NVM_info_s.NVM_generic_data_blk_s.cmd_list[i].cmd );
		CLI_send_data( output_string, strlen(output_string));
	}

	CLI_send_newline();

	STDC_memset( output_string, 0x00, sizeof( output_string ) );
	sprintf( output_string, "/*** Whitelist ID's ***/" );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();

	data_p = NVM_info_s.NVM_generic_data_blk_s.rf_whitelist;

	for( i = 0u; i < RF_MGR_RF_DATA_HANDLER_SIZE/4u; i++ )
	{
		STDC_memset( output_string, 0x00, sizeof( output_string ) );
		sprintf( output_string, " %2d ID:0x%04X, %2d ID:0x%04X, %2d ID:0x%04X, %2d ID:0x%04X",
				(i*4), *(data_p + (i*4)), ((i*4) + 1), *(data_p + (i*4) + 1), ((i*4) + 2), *(data_p + (i*4) + 2), ((i*4) + 3), *(data_p + (i*4) + 3) );
		CLI_send_data( output_string, strlen(output_string));
		CLI_send_newline();
	}
	CLI_send_newline();

	STDC_memset( output_string, 0x00, sizeof( output_string ) );
	sprintf( output_string, "/* Thermostat */" );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();

	/* setup the pointer */
	temp_data_p = &NVM_info_s.NVM_generic_data_blk_s.cool_max_temp;

	for( i = 0; i < 4; i++ )
	{
		temp_val = ( ( (*temp_data_p) * 10u ) );
		divisor = ( temp_val / 10u );
		divident = ( temp_val - ( divisor ) * 10 );

		temp_data_p++;

		STDC_memset( output_string, 0x00, sizeof( output_string ) );
		sprintf( output_string, "%s:\t%d.%d",
				strings[i],
				(divisor),
				(divident) );

		CLI_send_data( output_string, strlen(output_string));
		CLI_send_newline();

	}

	return( error );
}


CLI_error_et clocks_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];

	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq (&RCC_Clocks);

	sprintf( output_string, "SYSCLK:\t%dHz\r\nHCLK:\t%dHz\r\nPCLK1:\t%dHz\r\nPCLK2:\t%dHz\r\nADCCLK:\t%dHz\r\n",
			(int)RCC_Clocks.SYSCLK_Frequency, (int)RCC_Clocks.HCLK_Frequency, (int)RCC_Clocks.PCLK1_Frequency,
			(int)RCC_Clocks.PCLK2_Frequency, (int)RCC_Clocks.ADCCLK_Frequency );

	CLI_send_newline();
	CLI_send_data( output_string, strlen(output_string));

	return( error );
}


CLI_error_et temp_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];

	sprintf( output_string, "The internal device temperature is not yet supported!!!" );

	CLI_send_newline();
	CLI_send_data( output_string, strlen(output_string));

	return( error );
}

CLI_error_et batt_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];

	sprintf( output_string, "The internal battery/supply voltage is not yet supported!!!" );

	CLI_send_newline();
	CLI_send_data( output_string, strlen(output_string));

	return( error );
}


CLI_error_et listnodes_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];

	u8_t node_idx = 0u;
	u8_t num_nodes = 0u;

	RF_MGR_rf_data_store_st* node_id_p;

	CLI_send_newline();

	node_id_p = RF_MGR_get_all_decoded_IDs_address();

	for( node_idx = 0; node_idx < RF_MGR_RF_DATA_HANDLER_SIZE; node_idx++ )
	{
		if( node_id_p->data_packet_s[node_idx].node_id != 0x0000 )
		{
			num_nodes ++;
		}
		sprintf( output_string, "Node ID %02d:\t0x%04X\r\n", node_idx, node_id_p->data_packet_s[node_idx].node_id );
		CLI_send_data( output_string, strlen(output_string));
		STDC_memset( output_string, 0x20, sizeof( output_string ) );
	}

	sprintf( output_string, "Num Free Nodes:\t%02d\r\n", ( RF_MGR_RF_DATA_HANDLER_SIZE - num_nodes ) );
	CLI_send_data( output_string, strlen(output_string));
	CLI_send_newline();
	STDC_memset( output_string, 0x20, sizeof( output_string ) );

	return( error );
}




CLI_error_et led_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	HAL_BRD_led_et led = 0u;
	off_on_et state = OFF;

	(void)output_string;

	CLI_send_newline();

	/* What LED is the user trying to control */
	led = strtoul( aArgVector[1], NULL, 16 );
	state = (off_on_et)strtoul( aArgVector[2], NULL, 16 );

	if( led == 0x0a )
	{
		HAL_BRD_set_LED_state( LED_0, state );
		HAL_BRD_set_LED_state( LED_1, state );
		HAL_BRD_set_LED_state( LED_2, state );
		HAL_BRD_set_LED_state( LED_3, state );
	}
	else
	{
		HAL_BRD_set_LED_state( led, state );
	}

	return( error );
}


CLI_error_et wl_add_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	pass_fail_et result;
	u16_t id;

	/* What ID are we trying to add */
	id = strtoul( aArgVector[1], NULL, 16 );

	CLI_send_newline();

	result = RF_MGR_add_wl_node( id );

	if( result == PASS )
	{
		sprintf( output_string, "Node ID 0x%04X successfully added", id );
		CLI_send_data( output_string, strlen(output_string));
		CLI_send_newline();
	}
	else
	{
		sprintf( output_string, "Failed to add Node ID 0x%04X", id );
		CLI_send_data( output_string, strlen(output_string));
		CLI_send_newline();
	}


	return( error );
}



CLI_error_et wl_remove_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	pass_fail_et status = FAIL;
	u16_t id = 0u;
	RF_MGR_whitelist_st* data_p;
	u8_t nodes;

	/* What ID is the user trying to remove */
	id = strtoul( aArgVector[1], NULL, 16 );

	/* This function should handle everything */
	status = RF_MGR_remove_wl_node( id );

	CLI_send_newline();

	if( status == PASS )
	{
		sprintf( output_string, "Node 0x%04X was located in the current whitelist and has now been removed...", id );
		CLI_send_data( output_string, strlen(output_string));
		CLI_send_newline();
		STDC_memset( output_string, 0x20, sizeof( output_string ) );
	}
	else
	{
		sprintf( output_string, "Node 0x%04X has not been located in the whitelist!!!", id );
		CLI_send_data( output_string, strlen(output_string));
		CLI_send_newline();
		STDC_memset( output_string, 0x20, sizeof( output_string ) );
	}

	return( error );
}


CLI_error_et wl_display_handler( u8_t aArgCount, char *aArgVector[] )
{
	CLI_error_et error = CLI_ERROR_NONE;
	char output_string[200];
	u8_t i = 0u;
	RF_MGR_whitelist_st *data_p;

